tutorials/cgnsConverters/test3/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-1 -1 0.01);

boundaryField
{
    hub
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shroud
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    perio1
    {
        type            cyclic;
    }

    inflow
    {
        type            fixedValue;
        value           uniform (-4.7 -5.2 0);
    }

    outflow
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
